OdDAI.Session.createRepoFromBuffer(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*,OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Creates repository with defined name inside current session and opens a buffered model as part of the
newly created repository.
\param bufferedModel [in] A buffered model to open as part of newly created repository.
\param name [in] A name of repository to create.
\returns Returns a smart pointer to the newly created repository.